
#Область ОбработчикиСобытийРеквизитовФорм

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ИзменитьСуммуДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ИзменитьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИзменитьСуммуДокумента()
		
	ТекущиеДанныеТЧ = Элементы.Товары.ТекущиеДанные;
	
	ТекущиеДанныеТЧ.Сумма = ТекущиеДанныеТЧ.Количество * ТекущиеДанныеТЧ.Цена;
	
КонецПроцедуры

#КонецОбласти